duxinglang-1/nRF9160_test/E2_V1_NCS1.9.0_TEST/src/nb/nb.c
void SetNetWorkParaByPlmn(uint8_t *imsi)
{
	SetNetWorkApn(imsi);
	SetNwtWorkMqttBroker(imsi);
}

void GetModemInfor(void)
{
	uint8_t tmpbuf[256] = {0};

	if(at_cmd_write(CMD_GET_MODEM_V, tmpbuf, sizeof(tmpbuf), NULL) == 0)
	{
	#ifdef NB_DEBUG
		LOGD("MODEM version:%s", &tmpbuf);
	#endif

		strncpy(g_modem, &tmpbuf, MODEM_MAX_LEN);
	}

#if 0
	if(at_cmd_write(CMD_GET_SUPPORT_BAND, tmpbuf, sizeof(tmpbuf), NULL) == 0)
	{
	#ifdef NB_DEBUG
		LOGD("support band:%s", tmpbuf);
	#endif
	}

	if(at_cmd_write(CMD_GET_CUR_BAND, tmpbuf, sizeof(tmpbuf), NULL) == 0)
	{
	#ifdef NB_DEBUG
		LOGD("current band:%s", tmpbuf);
	#endif
	}

	if(at_cmd_write(CMD_GET_LOCKED_BAND, tmpbuf, sizeof(tmpbuf), NULL) == 0)
	{
	#ifdef NB_DEBUG
		LOGD("locked band:%s", tmpbuf);
	#endif
	}
#endif

	if(at_cmd_write(CMD_GET_IMEI, tmpbuf, sizeof(tmpbuf), NULL) == 0)
	{
	#ifdef NB_DEBUG
		LOGD("imei:%s", tmpbuf);
	#endif
		strncpy(g_imei, tmpbuf, IMEI_MAX_LEN);
	}

	if(at_cmd_write(CMD_GET_IMSI, tmpbuf, sizeof(tmpbuf), NULL) == 0)
	{
	#ifdef NB_DEBUG
		LOGD("imsi:%s", tmpbuf);
	#endif
		strncpy(g_imsi, tmpbuf, IMSI_MAX_LEN);
	}

	if(at_cmd_write(CMD_GET_ICCID, tmpbuf, sizeof(tmpbuf), NULL) == 0)
	{
	#ifdef NB_DEBUG
		LOGD("iccid:%s", &tmpbuf[9]);
	#endif
		strncpy(g_iccid, &tmpbuf[9], ICCID_MAX_LEN);
	}
}

void GetModemStatus(void)
{
	char *ptr;
	int i=0,len,err;
	uint8_t strbuf[64] = {0};
	uint8_t tmpbuf[256] = {0};

	if(at_cmd_write(CMD_GET_MODEM_PARA, tmpbuf, sizeof(tmpbuf), NULL) == 0)
	{
	#ifdef NB_DEBUG
		LOGD("MODEM parameter:%s", &tmpbuf);
	#endif
		DecodeModemMonitor(tmpbuf, strlen(tmpbuf));
	}
}

void SetModemTurnOn(void)
{
	if(at_cmd_write("AT+CFUN=1", NULL, 0, NULL) == 0)
	{
	#ifdef NB_DEBUG
		LOGD("turn on modem success!");
	#endif
	}
	else
	{
	#ifdef NB_DEBUG
		LOGD("Can't turn on modem!");
	#endif
	}
}

void SetModemTurnOff(void)
{
	if(at_cmd_write("AT+CFUN=4", NULL, 0, NULL) == 0)
	{
	#ifdef NB_DEBUG
		LOGD("turn off modem success!");
	#endif
	}
	else
	{
	#ifdef NB_DEBUG
		LOGD("Can't turn off modem!");
	#endif
	}

	nb_connected = false;
}

void GetModemAPN(void)
{
	uint8_t tmpbuf[128] = {0};
	
	if(at_cmd_write(CMD_GET_APN, tmpbuf, sizeof(tmpbuf), NULL) == 0)
	{
	#ifdef NB_DEBUG
		LOGD("apn:%s", tmpbuf);	
	#endif
	}
}

void SetModemAPN(void)
{
	uint8_t tmpbuf[128] = {0};
	
	if(at_cmd_write("AT+CGDCONT=0,\"IP\",\"arkessalp.com\"", tmpbuf, sizeof(tmpbuf), NULL) != 0)
	{
	#ifdef NB_DEBUG
		LOGD("set apn fail!");
	#endif
	}

	if(at_cmd_write(CMD_GET_APN, tmpbuf, sizeof(tmpbuf), NULL) != 0)
	{
	#ifdef NB_DEBUG
		LOGD("Get apn fail!");
	#endif
		return;
	}
#ifdef NB_DEBUG
	LOGD("apn:%s", tmpbuf);	
#endif
}

static void modem_init(struct k_work *work)
{
	SetModemTurnOn();

	k_delayed_work_submit_to_queue(app_work_q, &nb_link_work, K_SECONDS(2));
}

static bool response_is_valid(const char *response, size_t response_len, const char *check)
{
	if((response == NULL) || (check == NULL))
		return false;

	if((response_len < strlen(check))||(memcmp(response, check, response_len) != 0))
		return false;

	return true;
}

static int parse_nw_reg_status(const char *at_response, enum lte_lc_nw_reg_status *status, size_t reg_status_index)
{
	int err, reg_status;
	struct at_param_list resp_list = {0};
	char response_prefix[sizeof(AT_CEREG_RESPONSE_PREFIX)] = {0};
	size_t response_prefix_len = sizeof(response_prefix);

	if((at_response == NULL) || (status == NULL))
		return -EINVAL;

	err = at_params_list_init(&resp_list, AT_CEREG_PARAMS_COUNT_MAX);
	if(err)
		return err;

	/* Parse CEREG response and populate AT parameter list */
	err = at_parser_max_params_from_str(at_response,
					    NULL,
					    &resp_list,
					    AT_CEREG_PARAMS_COUNT_MAX);
	if(err)
		goto clean_exit;

	/* Check if AT command response starts with +CEREG */
	err = at_params_string_get(&resp_list,
				   AT_RESPONSE_PREFIX_INDEX,
				   response_prefix,
				   &response_prefix_len);
	if(err)
		goto clean_exit;

	if(!response_is_valid(response_prefix, response_prefix_len, AT_CEREG_RESPONSE_PREFIX))
		goto clean_exit;

	/* Get the network registration status parameter from the response */
	err = at_params_int_get(&resp_list, reg_status_index, &reg_status);
	if(err)
		goto clean_exit;

	/* Check if the parsed value maps to a valid registration status */
	switch(reg_status)
	{
	case LTE_LC_NW_REG_NOT_REGISTERED:
	case LTE_LC_NW_REG_REGISTERED_HOME:
	case LTE_LC_NW_REG_SEARCHING:
	case LTE_LC_NW_REG_REGISTRATION_DENIED:
	case LTE_LC_NW_REG_UNKNOWN:
	case LTE_LC_NW_REG_REGISTERED_ROAMING:
	case LTE_LC_NW_REG_REGISTERED_EMERGENCY:
	case LTE_LC_NW_REG_UICC_FAIL:
		*status = reg_status;
		break;
		
	default:
		err = -EIO;
	}

clean_exit:
	at_params_list_free(&resp_list);
	return err;
}

static void at_handler(void *context, const char *response)
{
	ARG_UNUSED(context);

	int err;
	enum lte_lc_nw_reg_status status;

	if(response == NULL)
		return;

	err = parse_nw_reg_status(response, &status, AT_CEREG_REG_STATUS_INDEX);
	if(err)
		return;

	if((status == LTE_LC_NW_REG_REGISTERED_HOME) ||
	    (status == LTE_LC_NW_REG_REGISTERED_ROAMING))
	{
		k_sem_give(&net_link);
	}
}

static int net_connect(void)
{
	int err, rc;
	const char *current_network_mode = nw_mode_preferred;
	bool retry;

	k_sem_init(&net_link, 0, 1);

	rc = at_notif_register_handler(NULL, at_handler);
	if(rc != 0)
		return rc;

	do
	{
		retry = false;

		if(at_cmd_write(current_network_mode, NULL, 0, NULL) != 0)
		{
			err = -EIO;
			goto exit;
		}

		NBGetNetMode(current_network_mode);

		if(at_cmd_write(normal, NULL, 0, NULL) != 0)
		{
			err = -EIO;
			goto exit;
		}

		err = k_sem_take(&net_link, K_SECONDS(CONFIG_LTE_NETWORK_TIMEOUT));
		if(err == -EAGAIN)
		{
		#ifdef NB_DEBUG
			LOGD("Network connection attempt timed out");
		#endif

			if(IS_ENABLED(CONFIG_LTE_NETWORK_USE_FALLBACK)&&(current_network_mode == nw_mode_preferred))
			{
				current_network_mode = nw_mode_fallback;
				retry = true;

				if(at_cmd_write(offline, NULL, 0, NULL) != 0)
				{
					err = -EIO;
					goto exit;
				}
			#ifdef NB_DEBUG
				LOGD("Using fallback network mode");
			#endif
			}
			else
			{
				err = -ETIMEDOUT;
			}
		}
	}while(retry);

