duxinglang-1/nRF9160_test/E2_V1_NCS1.9.0_TEST/src/nb/nb.c
exit:
	rc = at_notif_deregister_handler(NULL, at_handler);
	if(rc != 0)
	{
	#ifdef NB_DEBUG
		LOGD("Can't de-register handler rc=%d", rc);
	#endif
	}

	return err;
}

static int net_init_and_link(void)
{
	int ret;

	ret = lte_lc_init();
	if(ret)
	{
		return ret;
	}

	return net_connect();
}

static void nb_link(struct k_work *work)
{
	int err=0;
	uint8_t tmpbuf[128] = {0};
	static uint32_t retry_count = 0;
	static bool frist_flag = false;

#ifndef NB_SIGNAL_TEST
	if(!frist_flag)
	{
		frist_flag = true;
		GetModemInfor();
		SetModemTurnOff();
		SetNetWorkParaByPlmn(g_imsi);
	}
	else if(strlen(g_imsi) == 0)
	{
		SetModemTurnOn();
		GetModemInfor();
		SetModemTurnOff();
		SetNetWorkParaByPlmn(g_imsi);
	}
#endif

	/*if(gps_is_working())
	{
	#ifdef NB_DEBUG
		LOGD("gps is working, continue waiting!");
	#endif
	
		if(retry_count <= 2)		//2次以内每1分钟重连一�
			k_timer_start(&nb_reconnect_timer, K_SECONDS(60), K_NO_WAIT);
		else if(retry_count <= 4)	//3�次�分钟重连一�
			k_timer_start(&nb_reconnect_timer, K_SECONDS(300), K_NO_WAIT);
		else if(retry_count <= 6)	//5�次�分钟重连一�
			k_timer_start(&nb_reconnect_timer, K_SECONDS(600), K_NO_WAIT);
		else if(retry_count <= 8)	//7�次�小时重连一�
			k_timer_start(&nb_reconnect_timer, K_SECONDS(3600), K_NO_WAIT);
		else						//8次以上每6小时重连一�
			k_timer_start(&nb_reconnect_timer, K_SECONDS(6*3600), K_NO_WAIT);	
	}
	else
	{*/
	#ifdef NB_DEBUG
		LOGD("linking");
	#endif
	
		nb_connecting_flag = true;
		configure_low_power();
		err = net_init_and_link();
		if(err)
		{
		#ifdef NB_DEBUG
			LOGD("Can't connected to LTE network. err:%d", err);
		#endif
		
		#ifdef CONFIG_SYNC_SUPPORT
			SyncNetWorkCallBack(SYNC_STATUS_FAIL);
		#endif

			nb_connected = false;

			retry_count++;
			if(retry_count <= 2)		//2次以内每1分钟重连一�
				k_timer_start(&nb_reconnect_timer, K_SECONDS(60), K_NO_WAIT);
			else if(retry_count <= 4)	//3�次�分钟重连一�
				k_timer_start(&nb_reconnect_timer, K_SECONDS(300), K_NO_WAIT);
			else if(retry_count <= 6)	//5�次�分钟重连一�
				k_timer_start(&nb_reconnect_timer, K_SECONDS(600), K_NO_WAIT);
			else if(retry_count <= 8)	//7�次�小时重连一�
				k_timer_start(&nb_reconnect_timer, K_SECONDS(3600), K_NO_WAIT);
			else						//8次以上每6小时重连一�
				k_timer_start(&nb_reconnect_timer, K_SECONDS(6*3600), K_NO_WAIT);
		}
		else
		{
		#ifdef NB_DEBUG
			LOGD("Connected to LTE network");
		#endif
			
			nb_connected = true;
			retry_count = 0;
		#ifdef CONFIG_MODEM_INFO
			modem_data_init();
		#endif
			GetModemDateTime();
			NBRedrawNetMode();
		}

		GetModemStatus();

	#ifndef NB_SIGNAL_TEST
		if(!nb_connected)
			SetModemTurnOff();
		
		if(!err && !test_nb_flag)
		{
			k_delayed_work_submit_to_queue(app_work_q, &mqtt_link_work, K_SECONDS(2));
		}
	#endif

		nb_connecting_flag = false;
	//}
}

void GetNBSignal(void)
{
	uint8_t str_rsrp[128] = {0};

	if(at_cmd_write("AT+CFUN?", str_rsrp, sizeof(str_rsrp), NULL) == 0)
	{
	#ifdef NB_DEBUG	
		LOGD("cfun:%s", str_rsrp);
	#endif
	}

	if(at_cmd_write("AT+CPSMS?", str_rsrp, sizeof(str_rsrp), NULL) == 0)
	{
	#ifdef NB_DEBUG
		LOGD("cpsms:%s", str_rsrp);
	#endif
	}
	
	if(at_cmd_write(CMD_GET_CESQ, str_rsrp, sizeof(str_rsrp), NULL) == 0)
	{
	#ifdef NB_DEBUG	
		LOGD("cesq:%s", str_rsrp);
	#endif
	}

	if(at_cmd_write(CMD_GET_APN, str_rsrp, sizeof(str_rsrp), NULL) == 0)
	{
	#ifdef NB_DEBUG	
		LOGD("apn:%s", str_rsrp);
	#endif
	}
	
	if(at_cmd_write(CMD_GET_CSQ, str_rsrp, sizeof(str_rsrp), NULL) == 0)
	{
	#ifdef NB_DEBUG	
		LOGD("csq:%s", str_rsrp);
	#endif
	}
}

bool nb_is_connecting(void)
{
#ifdef NB_DEBUG
	LOGD("nb_connecting_flag:%d", nb_connecting_flag);
#endif
	return nb_connecting_flag;
}

bool nb_is_connected(void)
{
	return nb_connected;
}

void nb_test_update(void)
{
	if(screen_id == SCREEN_ID_NB_TEST)
		scr_msg[screen_id].act = SCREEN_ACTION_UPDATE;
}

void NBMsgProcess(void)
{
	if(test_nb_on)
	{
		test_nb_on = false;
		if(nb_is_running)
			return;

		nb_is_running = true;
		test_nb_flag = true;
	#ifdef NB_DEBUG
		LOGD("Start NB-IoT test!");
	#endif
	
		if(nb_is_connected())
		{
			k_timer_start(&get_nw_rsrp_timer, K_MSEC(1000), K_MSEC(1000));
		}
		else if(nb_is_connecting())
		{
			strcpy(nb_test_info, "LTE Link Connecting ...");
			TestNBUpdateINfor();
		}
		else
		{
			SetModemTurnOff();
			modem_configure();
		}
	}

	if(get_modem_info_flag)
	{	
		GetModemInfor();
		get_modem_info_flag = false;
	}

	if(nb_redraw_sig_flag)
	{
		NBRedrawSignal();
		nb_redraw_sig_flag = false;
	}

	if(get_modem_signal_flag)
	{
		GetModemSignal();
		get_modem_signal_flag = false;
	}

	if(get_modem_time_flag)
	{	
		GetModemDateTime();
		get_modem_time_flag = false;
	}

	if(get_modem_status_flag)
	{
		GetModemStatus();
		get_modem_status_flag = false;
	}
	
	if(send_data_flag)
	{
		NbSendData();
		send_data_flag = false;
	}

	if(parse_data_flag)
	{
		ParseReceData();
		parse_data_flag = false;
	}
	
	if(mqtt_disconnect_flag)
	{
		MqttDisConnect();
		mqtt_disconnect_flag = false;
	}

	if(nb_test_update_flag)
	{
		nb_test_update_flag = false;
		nb_test_update();
	}

	if(nb_reconnect_flag)
	{
		nb_reconnect_flag = false;
		//if(test_gps_flag) \\enable when using GPS
		//	return;

		k_delayed_work_submit_to_queue(app_work_q, &nb_link_work, K_SECONDS(2));
	}
	
	if(nb_connecting_flag)
	{
		k_sleep(K_MSEC(5));
	}
}

void NB_init(struct k_work_q *work_q)
{
	int err;

	app_work_q = work_q;

	k_delayed_work_init(&modem_init_work, modem_init);
	k_delayed_work_init(&nb_link_work, nb_link);
	k_delayed_work_init(&mqtt_link_work, mqtt_link);
#ifdef CONFIG_FOTA_DOWNLOAD
	fota_work_init(work_q);
#endif
#ifdef CONFIG_DATA_DOWNLOAD_SUPPORT
	dl_work_init(work_q);
#endif

#ifdef NB_SIGNAL_TEST
	k_delayed_work_submit_to_queue(app_work_q, &nb_link_work, K_SECONDS(5));
#else
	k_delayed_work_submit_to_queue(app_work_q, &modem_init_work, K_SECONDS(5));
#endif
}
